[net]
# https://github.com/Eric3911/yolov3_darknet, improved by Duan.
batch=1
subdivisions=1
width=768
height=448
channels=3
momentum=0.9
decay=4e-5
angle=0
saturation=1.5
exposure=1.5
hue=.1

learning_rate=0.000261
burn_in=1000
max_batches=800020
policy=steps
steps=400000,650000
scales=.1,.1

#mosaic=1


########## YOLO Backbone layers ##########
# 1
[convolutional]        
batch_normalize=1
filters=24
size=3
stride=1
pad=1
activation=leaky

[convolutional]        
batch_normalize=1
filters=36
size=3
stride=2
pad=1
activation=leaky

[convolutional]        
batch_normalize=1
filters=24
size=1
stride=1
pad=1
activation=leaky

[convolutional]        
batch_normalize=1
filters=36
size=3
stride=1
pad=1
activation=leaky

[shortcut]             
from=-3
activation=linear

# Downsample
[convolutional]        
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=leaky

[convolutional]        
batch_normalize=1
filters=36
size=1
stride=1
pad=1
activation=leaky

[convolutional]        
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[shortcut]             
from=-3
activation=linear

[convolutional]        
batch_normalize=1
filters=36
size=1
stride=1
pad=1
activation=leaky

[convolutional]        
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[shortcut]             
from=-3
activation=linear

# Downsample
[convolutional]        
batch_normalize=1
filters=96
size=3
stride=2
pad=1
activation=leaky

[convolutional]        
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]        
batch_normalize=1
filters=96
size=3
stride=1
pad=1
activation=leaky

[shortcut]             
from=-3
activation=linear

[convolutional]        
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]        
batch_normalize=1
filters=96
size=3
stride=1
pad=1
activation=leaky

[shortcut]             
from=-3
activation=linear

[convolutional]        
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]        
batch_normalize=1
filters=96
size=3
stride=1
pad=1
activation=leaky

[shortcut]            
from=-3
activation=linear

# Downsample
[convolutional]        
batch_normalize=1
filters=160
size=3
stride=2
pad=1
activation=leaky

[convolutional]        
batch_normalize=1
filters=96
size=1
stride=1
pad=1
activation=leaky

[convolutional]        
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=leaky

[shortcut]             
from=-3
activation=linear

[convolutional]        
batch_normalize=1
filters=96
size=1
stride=1
pad=1
activation=leaky

[convolutional]        
batch_normalize=1
filters=160
size=3
stride=1
pad=1
activation=leaky

[shortcut]             
from=-3
activation=linear

# Downsample
[convolutional]        
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=leaky

[convolutional]        
batch_normalize=1
filters=160
size=1
stride=1
pad=1
activation=leaky

[convolutional]        
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]             
from=-3
activation=linear

[convolutional]        
batch_normalize=1
filters=160
size=1
stride=1
pad=1
activation=leaky

[convolutional]        
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]             
from=-3
activation=linear

######################

[convolutional]        
batch_normalize=1
filters=160
size=1
stride=1
pad=1
activation=leaky

[convolutional]        
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]        
batch_normalize=1
filters=160
size=1
stride=1
pad=1
activation=leaky

### SPP ###
[maxpool]              
stride=1
size=5

[route]                
layers=-2

[maxpool]              
stride=1
size=9

[route]                
layers=-4

[maxpool]              
stride=1
size=13

[route]                
layers=-1,-3,-5,-6

[convolutional]        
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=leaky
